<html>
<head>
	<title>Fax-Plugin - Liesmich</title>

	<style type="text/css">
	<!--
		BODY
		{
			background-color: #666666;
			margin: 0px;
		}

		BODY,DIV,SPAN,P,TD
		{
			color: #333333;
			font-family: verdana, arial;
			font-size: 12px;
		}

		H1
		{
			color: #FFFFFF;
			background-color: #F2911D;
			text-align: left;
			padding: 15px;
			margin-top: 0px;
		}

		H2
		{
			margin-top: 20px;
			font-size: 14px;
			border-bottom: 1px solid #333333;
		}

		LI
		{
			margin-top: 5px;
		}

		A
		{
			color: #0000FF;
			text-decoration: none;
		}

		A:hover
		{
			text-decoration: underline;
		}

		.footer
		{
			color: #FFFFFF;
			background-color: #F2911D;
			text-align: center;
			padding: 5px;
		}

		.important
		{
			color: red;
		}

		.tabActive
		{
			background-color: #F2911D;
			color: #FFFFFF;
			padding: 10px;
			line-height: 24px;
		}

		.tabInactive
		{
			color: #EFEFEF;
			padding: 10px;
			line-height: 24px;
			font-size: 11px;
		}

		.license
		{
			margin-left: 22px;
		}

		.license P
		{
			text-indent: -22px;
		}

		.noteBox
		{
			border: 1px solid #666666;
        	background-color: #FFFFCC;
			padding: 8px;
		}

		#tabBar
		{
			background-color: #666666;
		}

		#main
		{
			width: 80%;
			background-color: #FFFFFF;
			text-align: left;
		}

		#content
		{
			padding-left: 15px;
			padding-right: 15px;
			padding-bottom: 5px;
			text-align: justify;
		}
	//-->
	</style>
</head>

<body>

<center>
	<div id="main">
		<div id="tabBar">
			<a class="tabActive" href="liesmich.html">Liesmich (Deutsch)</a>
			<a class="tabInactive" href="readme.html">Readme (English)</a>
			<a class="tabInactive" href="changelog.html">Changelog</a>
		</div>

		<h1>Fax-Plugin Liesmich</h1>

		<div id="content">
			<p>
				Vielen Dank f&uuml;r den Erwerb des Fax-Plugins f&uuml;r b1gMail!
				In diesem Paket finden Sie alle Dateien, die Sie zur Installation ben&ouml;tigen.<br />
				Im Folgenden finden Sie eine Kurzanleitung zur Installation.
				Eine ausf&uuml;hrliche Installationsanleitung
				ist in der Dokumentation zum Plugin enthalten. Diese Liesmich-Datei dient nur als Anleitung
				zum Schnell-Einstieg.
			</p>

			<p>
				<h2>Installation</h2>

				Gehen Sie
				bitte wie folgt vor, falls Sie noch keine &auml;ltere Version des Fax-Plugins
				nutzen und eine Erst-Installation durchf&uuml;hren m&ouml;chten.

				<ol>
					<li>Laden Sie alle Dateien und Ordner im Ordner &quot;upload&quot; dieses Download-Archivs
						per FTP in den Ordner Ihrer b1gMail-Installation hoch.</li>
					<li>Loggen Sie sich in den Admin-Bereich Ihrer b1gMail-Installation ein.</li>
					<li>&Ouml;ffnen Sie die Seite &quot;Plugins&quot; im gleichnamigen Bereich.</li>
					<li>W&auml;hlen Sie die Register-Karte &quot;Installieren&quot;.</li>
					<li>W&auml;hlen Sie als &quot;Plugin-Paket&quot; die Datei &quot;Fax_(Lizenznummer).bmplugin&quot;,
						die in diesem Download-Archiv enthalten ist, aus und klicken Sie auf den Button
						&quot;Installieren&quot;.</li>
					<li>Pr&uuml;fen Sie die angezeigten Hinweise zur Plugin-Herkunft und klicken Sie
						dann auf den Button &quot;Installieren&quot;.</li>
					<li>Wechseln Sie in den Administrations-Bereich des Fax-Plugins, indem Sie links im Men&uuml;
						auf &quot;Fax&quot; klicken.</li>
					<li>Rufen Sie die Register-Karte &quot;Gateways&quot; auf und geben Sie die Zugangsdaten f&uuml;r
						das Gateway ein, das Sie nutzen m&ouml;chten. Klicken Sie danach auf &quot;Speichern&quot;.<br />
						<em>Hinweis:</em> Wenn Sie das SMSKaufen-Gateway nutzen m&ouml;chten, empfehlen wir die
							Wahl des Gateway-Eintrags &quot;SMSKaufen (HTTP)&quot;.</li>
					<li>Rufen Sie die Register-Karte &quot;Einstellungen&quot; auf und w&auml;hlen Sie unter
						&quot;Voreinstellungen&quot; als &quot;Standard-Gateway&quot; das Gateway aus, das Sie
						verwenden m&ouml;chten.</li>
					<li>Aktivieren Sie die Option &quot;Fax&quot; in den Gruppen-Einstellungen f&uuml;r
						die Benutzer-Gruppen, denen Sie den Fax-Versand erlauben m&ouml;chten.</li>
				</ol>

				Falls Sie das <strong>SMSKaufen</strong>-Gateway verwenden, befolgen Sie bitte noch die folgenden zus&auml;tzlichen
				Schritte:
				<ol>
					<li>Loggen Sie sich in den Kunden-Bereich von SMSKaufen ein.</li>
					<li>Rufen Sie den Men&uuml;-Punkt &quot;Fax-Dienste&quot; &raquo; &quot;Preise und Einrichtung&quot;
						auf.</li>
					<li>Geben Sie als Fax-Push-Adresse die Adresse
						<blockquote><code>(URL zu Ihrer b1gMail-Installation)index.php/faxPluginStatusPush/</code></blockquote>
						ein, wobei Sie den URL Ihrer b1gMail-Installation einsetzen. Beispiel:
						<blockquote><code>http://www.domain.xy/mail/index.php/faxPluginStatusPush/</code></blockquote>
						Klicken Sie dann auf &quot;Push &auml;ndern&quot;.</li>
				</ol>

				Falls Sie das <strong>Computron-GNetX</strong>-Gateway verwenden, befolgen Sie bitte noch die folgenden zus&auml;tzlichen
				Schritte:
				<ol>
					<li>Loggen Sie sich in den Kunden-Bereich (&quot;Email-to-Fax&quot;) von Computron GNetX ein.</li>
					<li>Rufen Sie den Men&uuml;-Punkt &quot;Email Sendeberichte&quot;
						auf.</li>
					<li>Geben Sie als E-Mail-Adresse (Feld &quot;Email&quot;) <code>mailfrom</code>
						und als Art <code>Automatisch auswertbar</code> an und klicken Sie dann auf
						&quot;Einstellungen &uuml;bernehmen&quot;.</li>
				</ol>
			</p>

			<p>
				<h2>Update von alter Fax-Plugin-Version</h2>

				Wenn Sie das Fax-Plugin bereits in einer &auml;lteren Version nutzen, gehen Sie
				wie folgt vor, um auf die aktuelle Version zu aktualisieren.
				Ihre Daten bleiben beim Update erhalten.

				<ol>
					<li><font color="red">Deaktivieren/l&ouml;schen Sie die alte Version des Plugins w&auml;hrend des gesamten
						Prozesses <b>nicht</b>. Sie wird automatisch &uuml;berschrieben.</font></li>
					<li>Laden Sie alle Dateien und Ordner im Ordner &quot;upload&quot; dieses Download-Archivs
						per FTP in den Ordner Ihrer b1gMail-Installation hoch.</li>
					<li>Loggen Sie sich in den Admin-Bereich Ihrer b1gMail-Installation ein.</li>
					<li>&Ouml;ffnen Sie die Seite &quot;Plugins&quot; im gleichnamigen Bereich.</li>
					<li>W&auml;hlen Sie die Register-Karte &quot;Installieren&quot;.</li>
					<li>W&auml;hlen Sie als &quot;Plugin-Paket&quot; die Datei &quot;FaxPlugin_(Lizenznummer).bmplugin&quot;,
						die in diesem Download-Archiv enthalten ist, aus und klicken Sie auf den Button
						&quot;Installieren&quot;.</li>
					<li>Pr&uuml;fen Sie die angezeigten Hinweise zur Plugin-Herkunft und klicken Sie
						dann auf den Button &quot;Installieren&quot;.</li>
				</ol>
			</p>

			<p>
				<h2>Lizenzbedingungen</h2>

				<div class="license">
					<p>§1 Die Nutzung dieser Software unterliegt den folgenden Lizenzbedingungen. Ein Versto&szlig; gegen die Lizenz ist verboten und wird vom Hersteller verfolgt. Bei Versto&szlig; gegen die Lizenzbedingungen kann der Hersteller die Lizenz jederzeit zur&uuml;cknehmen, ohne Kaufpreis oder sonstiges zu erstatten.</p>
					<p>§2 Sofern nicht eine copyrightverweisfreie Version der Software erworben wurde, ist es verboten, den Copyrightverweis zu modifizieren oder zu entfernen. Der Verweis muss gut sichtbar am Ende jeder Seite vorhanden sein.</p>
					<p>§3 Eine Lizenz ist immer nur f&uuml;r eine parallele Installation der Software g&uuml;ltig; und zwar f&uuml;r die Installation, die unter der im Kundencenter hinterlegten Domain erreichbar ist (sofern zutreffend). Bei erneuter Installation der Lizenz werden alle vorherigen Installationen dieser Lizenz ung&uuml;ltig und m&uuml;ssen entfernt werden. F&uuml;r mehrere Installationen sind auch entsprechend viele Lizenzen notwendig. Liegt eine copyrightverweisfreie Lizenz vor, darf nur bei der Installation dieser Lizenz der Verweis entfernt werden, f&uuml;r eventuell andere vorhandene Lizenzen mit Copyrightverweis gilt dies nicht.</p>
					<p>§4 Sie sind in keinem Fall befugt, unrechtm&auml;&szlig;ige Kopien der Software, ob in Originalform oder in modifizierter Form, zu erstellen bzw. diese zu verteilen und/oder weiterzugeben.</p>
					<p>§5 Als Inhaber einer Lizenz der Software sind Sie dazu befugt, auf eigenes Risiko die Software anzupassen und zu modifizieren. Eine Weitergabe der Software ist jedoch in keinem Falle, siehe §4, gestattet. Wenn Sie eigene &Auml;nderungen weitergeben wollen ist dies nur gestattet, wenn keine Teile der Software, weder Text, Bilder, Code noch sonstige Teile, mitverteilt werden.</p>
					<p>§6 Die Verwendung der Software geschieht auf Risiko des Lizenzinhabers. Der Hersteller &uuml;bernimmt keinerlei Haftung f&uuml;r Folgeanspr&uuml;che, die aus dem Betrieb der Software begr&uuml;ndet werden, mit Ausnahme von Vorsatz und grober Fahrl&auml;ssigkeit. Der Hersteller garantiert nicht f&uuml;r die Nutzbarkeit der Software f&uuml;r einen bestimmten Einsatzzweck. Jegliche Forderungen im Streitfall gehen maximal bis zum Kaufpreis der Lizenz.</p>
					<p>§7 Der Hersteller kann in keiner Weise f&uuml;r Daten, die mittels der Software verfasst, erfasst, erstellt, vertrieben, ausgetauscht (usw.) werden, haftbar gemacht werden. Der Hersteller ist nicht haftbar f&uuml;r den Betrieb der Accounts, die mit der Software verwaltet werden und kann auf diese nicht zugreifen.</p>
					<p>§8 Die Software enth&auml;lt einen Update-Mechanismus, der &uuml;ber das Internet durch Kontaktierung eines Servers des Herstellers Aktualisierungen f&uuml;r das Produkt herunterladen und installieren kann. Beim Update-Prozess wird die Lizenz durch &Uuml;bertragen der Lizenz- und Seriennummer verifiziert. Eine Installation von Updates erfolgt niemals vollautomatisch sondern nur nach Best&auml;tigung durch den Benutzer.</p>
					<p>§9 Die Software enth&auml;lt von Setasign lizenzierte Komponenten zur PDF-Verarbeitung (FPDI-PDF-Parser). Eine Nutzung dieser Komponenten ist nur im Zusammenhang mit diesem Produkt gestattet. Die von Setasign entwickelten Komponenten d&uuml;rfen unter keinen Umst&auml;nden aus dem Produkt extrahiert oder unabh&auml;ngig von diesem genutzt werden.</p>
					<p>§10 Erweist sich eine Bedingung dieser Lizenzbedingungen als unwirksam oder nichtig, so bleibt die Wirksamkeit der &uuml;brigen Bedingungen unber&uuml;hrt. Die ganz oder teilweise unwirksame oder nichtige Bedingung soll durch eine Bedingung ersetzt werden, die der unwirksamen oder nichtigen Bedingung m&ouml;glichst nahe kommt.</p>
				</div>
			</p>

			<p>
				<h2>Hilfe</h2>

				Sollten Probleme oder Fragen bei der Installation oder w&auml;hren des Betriebes
				auftauchen, finden Sie in der Dokumentation, die Sie im
				<a href="http://customers.b1gmail.com/" target="_blank">Kundencenter</a> erhalten oder per Klick auf
				das &quot;?&quot;-Symbol im Admin-Bereich kontextbezogen aufrufen k&ouml;nnen, wertvolle
				Informationen und Tipps. Weitere Anlaufstellen sind unsere
				<a href="http://kb.b1gmail.com/" target="_blank">Hilfe-/Support-Datenbank</a> und
				unser <a href="http://board.b1gmail.com/" target="_blank">Forum</a> (ausschlie&szlig;lich zum
				Austauch unter Kunden). Programm-Fehler k&ouml;nnen Sie im
				<a href="http://bugs.b1gmail.com/" target="_blank">Bug-Tracker</a> melden.<br />
				Sollte sich Ihre Frage auf diesen Wegen nicht beantworten bzw. Ihr Problem nicht l&ouml;sen
				lassen, z&ouml;gern Sie nicht, &uuml;ber das
				<a href="http://customers.b1gmail.com/" target="_blank">Kundencenter</a> unseren Support zu
				kontaktieren.
			</p>
		</div>

		<div class="footer">
			&copy; 2002-2018 B1G Software
		</div>
	</div>
</center>

</body>

</html>
